alplabai/alp-sdk/chips/gd32g553/gd32g553.c
/*
 * Copyright 2026 Alp Lab AB
 * SPDX-License-Identifier: Apache-2.0
 *
 * Host-side driver for the GD32G553 supervisor MCU bridge on V2N.
 *
 * The wire protocol is in docs/gd32-bridge-protocol.md.  The firmware
 * counterpart that implements the same command-handler table lives
 * under gd32-bridge-firmware:.
 *
 * This file is deliberately Zephyr-agnostic: all bus access goes
 * through <alp/peripheral.h> so the same source compiles into either
 * the Zephyr backend or the future baremetal backend.  The chip
 * driver does not introduce any platform timing primitives -- the
 * tens-of-microseconds gap between alp_spi_write and alp_spi_read
 * naturally falls out of the host-side function-call overhead and
 * is documented as the firmware's reply-staging window in
 * docs/gd32-bridge-protocol.md §4.1.
 */

#include <stddef.h>
#include <stdint.h>
#include <string.h>

#include "alp/chips/gd32g553.h"
#include "alp/protocol/crc16.h"

/* ----------------------------------------------------------------- */
/* CRC-16 / CCITT-FALSE  (poly 0x1021, init 0xFFFF, non-reflected,    */
/* xor-out 0x0000).  Reference vector: "123456789" -> 0x29B1.         */
/* Matches Zephyr's `crc16_itu_t(0xFFFF, ...)` and the matching       */
/* gd32-bridge-firmware:src/protocol.c implementation byte-for-byte.  */
/* alp_crc16_ccitt_false() (<alp/protocol/crc16.h>) is this exact     */
/* bitwise algorithm, header-only and stddef/stdint-only, so pulling  */
/* it in here does not add a Zephyr dependency to this deliberately   */
/* Zephyr-agnostic file.                                              */
/* ----------------------------------------------------------------- */

/* ----------------------------------------------------------------- */
/* Status-byte translation: wire encoding (unsigned) -> alp_status_t  */
/* (signed, negative-numbered).  See docs/gd32-bridge-protocol.md §6. */
/* ----------------------------------------------------------------- */

static alp_status_t status_from_wire(uint8_t s)
{
	switch (s) {
	case 0x00u:
		return ALP_OK;
	case 0x01u:
		return ALP_ERR_INVAL;
	case 0x02u:
		return ALP_ERR_NOT_READY;
	case 0x03u:
		return ALP_ERR_BUSY;
	case 0x04u:
		return ALP_ERR_TIMEOUT;
	case 0x05u:
		return ALP_ERR_IO;
	case 0x06u:
		return ALP_ERR_NOSUPPORT;
	case 0x07u:
		return ALP_ERR_NOMEM;
	case 0x08u:
		return ALP_ERR_OUT_OF_RANGE;
	case 0x80u: /* I2C: no pending command since last START */
		return ALP_ERR_NOT_READY;
	default:
		return ALP_ERR_IO;
	}
}

/* ----------------------------------------------------------------- */
/* Envelope sizes                                                     */
/* ----------------------------------------------------------------- */

/* Maximum wire-side payload either direction.  Driven by the largest
 * of (a) ADC_STREAM_READ which can reply up to
 * `1 + GD32G553_BRIDGE_ADC_STREAM_READ_MAX * 2` = 65 bytes (count
 * byte + u16 samples), and (b) ADC_DSP_STAGE_PUSH whose request
 * envelope carries a 7-byte chunk header plus up to
 * `GD32G553_BRIDGE_ADC_DSP_MAX_CHUNK_BYTES` = 58 bytes of stage
 * payload = 65 bytes total.  Matches the firmware-side
 * `GD32_BRIDGE_MAX_PAYLOAD_BYTES` so host + firmware serialise the
 * same wire envelopes; legacy small opcodes (ADC_READ at 17 bytes,
 * GET_BUILD_ID at 20 bytes, etc.) sit comfortably below. */
#define GD32G553_MAX_PAYLOAD_BYTES (1u + (GD32G553_BRIDGE_ADC_STREAM_READ_MAX * 2u))

/* SOF/CMD + payload + CRC for SPI; CMD + payload + CRC for I2C. */
#define GD32G553_MAX_SPI_FRAME_BYTES \
	(1u /* SOF */ + 1u /* CMD or STATUS */ + GD32G553_MAX_PAYLOAD_BYTES + 2u /* CRC */)

#define GD32G553_MAX_I2C_WRITE_BYTES \
	(1u /* reg=0x00 */ + 1u /* CMD */ + GD32G553_MAX_PAYLOAD_BYTES + 2u /* CRC */)

#define GD32G553_MAX_I2C_READ_BYTES (1u /* STATUS */ + GD32G553_MAX_PAYLOAD_BYTES + 2u /* CRC */)

/* ----------------------------------------------------------------- */
/* Transport: SPI                                                     */
/* ----------------------------------------------------------------- */

/* Reply re-read schedule.  The slave stages the reply inside the
 * REQUEST transaction's CS-rising handler; for slow handlers (ADC
 * conversion ~7 us/sample, TRNG conditioning, OTA FMC programming
 * ~70-140 us/chunk) the host's first reply read can land before the
 * reply is armed and clock idle/stale bytes instead.  Such a miss
 * does NOT consume the staged reply -- the slave's drain path rewinds
 * its staging cursor and re-arms the TX DMA on every CS cycle
 * (firmware >= v0.2.1; silicon-validated 2026-06-04) -- so re-READING
 * is always safe (no re-dispatch, no side effects).
 *
 * The schedule has two parts:
 *
 * 1. A fixed STAGING GAP before the first read.  The slave's CS-rising
 *    handler re-initialises its SPI peripheral (RCU flush), decodes,
 *    dispatches and re-arms both DMA channels before the reply exists
 *    -- a floor of a few tens of microseconds even for trivial
 *    handlers (bench 2026-06-04: at a ~15 us effective gap even
 *    GET_VERSION missed its first read every time, and each miss
 *    costs a wasted drain transaction plus a ladder wait, which is
 *    strictly worse than waiting out the floor).  35 us covers the
 *    rising path + trivial handlers; commands with real work fall
 *    through to the ladder.
 *
 * 2. A short-first backoff ladder between re-reads: cheap early
 *    retries keep ADC-burst-class handlers near the wire floor; the
 *    geometric tail covers OTA flash programming, bounding the total
 *    wait at ~3.2 ms. */
#define GD32G553_REPLY_STAGING_GAP_US 35u
static const uint16_t gd32g553_reply_retry_us[] = { 25u, 50u, 100u, 200u, 400u, 800u, 1600u };
#define GD32G553_REPLY_READ_TRIES \
	(1u + (sizeof(gd32g553_reply_retry_us) / sizeof(gd32g553_reply_retry_us[0])))

/* Staging gap for one command.  ADC conversions run inside the request's
 * CS-rising handler at ~18-20 us per SAMPLE on top of the base rising
 * path (bench-bracketed 2026-06-04 from the miss boundary at two sample
 * counts and three gap sizes) -- too slow for the host to wait out in
 * full (chasing it with a sized-to-cover gap measured WORSE than letting
 * the ladder's first rung catch the tail, because the oversized gap is
 * paid even when conversions finish early).  The 8 us/sample partial
 * cover is the measured optimum: it keeps the first read out of the
 * conversion burst's COLLISION window (a read racing the burst can be
 * swallowed whole by coalesced CS edges, turning one miss into two:
 * 356 us avg vs 196 us) while the ladder absorbs the remainder.  The
 * real fix for ADC reply latency is slave-side (sampling-time config),
 * tracked for the next firmware rev. */
static uint32_t
reply_staging_gap_us(uint8_t cmd, const uint8_t *req_payload, size_t req_payload_len)
{
	uint32_t gap = GD32G553_REPLY_STAGING_GAP_US;

