alplabai/alp-sdk/chips/gd32g553/gd32g553.c
	if (cmd == GD32G553_CMD_ADC_READ && req_payload != NULL && req_payload_len >= 2u) {
		gap += 8u * (uint32_t)req_payload[1];
	}
	return gap;
}

/* Forward declaration for the failed-command resync epilogue below. */
static alp_status_t spi_xfer(gd32g553_t    *ctx,
                             uint8_t        cmd,
                             const uint8_t *req_payload,
                             size_t         req_payload_len,
                             uint8_t       *reply_payload,
                             size_t         reply_payload_len);

/* Resync after a failed command.  The slave clears its staged reply
 * ONLY when it decodes a fresh request -- drains re-arm it (the
 * documented re-read semantics).  So when a command gives up (ladder
 * exhausted, or a short error envelope decoded), its stale staged
 * reply stays armed, and if the NEXT command's request is ever lost
 * to edge coalescing, that command reads the leftover -- at best a
 * CRC mismatch, at worst a perfectly valid error envelope attributed
 * to the WRONG command (observed 2026-06-04: GET_VERSION "returned"
 * a lingering TRNG BUSY).  One throwaway PING here forces a decode,
 * replacing the leftover with PING's reply and consuming it --
 * bounding staleness to the command that already failed.  Recursion
 * is depth-1 by construction: the epilogue never runs for PING. */
static void spi_resync_after_failure(gd32g553_t *ctx)
{
	(void)spi_xfer(ctx, 0x00u /* CMD_PING */, NULL, 0u, NULL, 0u);
}

static alp_status_t spi_xfer(gd32g553_t    *ctx,
                             uint8_t        cmd,
                             const uint8_t *req_payload,
                             size_t         req_payload_len,
                             uint8_t       *reply_payload,
                             size_t         reply_payload_len)
{
	if (ctx->spi == NULL) return ALP_ERR_NOSUPPORT;

	/* Request envelope: SOF | CMD | PAYLOAD | CRC(SOF..PAYLOAD) */
	uint8_t req[GD32G553_MAX_SPI_FRAME_BYTES];
	if (2u + req_payload_len + 2u > sizeof(req)) return ALP_ERR_INVAL;

	req[0] = GD32G553_BRIDGE_SOF;
	req[1] = cmd;
	if (req_payload_len > 0u && req_payload != NULL) {
		memcpy(&req[2], req_payload, req_payload_len);
	}
	const size_t   crc_covered = 2u + req_payload_len;
	const uint16_t crc         = alp_crc16_ccitt_false(req, crc_covered);
	req[crc_covered]           = (uint8_t)(crc & 0xFFu);
	req[crc_covered + 1u]      = (uint8_t)((crc >> 8) & 0xFFu);

	/* v0.7 STATUS_SEQ outer loop: one RE-SEND when a CRC-valid reply
     * turns out to be STALE -- its [7:4] stamp never advanced past the
     * previous accepted reply, meaning the slave never decoded our
     * request and is re-serving the old staged reply (the residual
     * hazard documented in the firmware's transport_spi.c; byte-exact
     * replays silicon-fingerprinted 2026-06-06).  A stale verdict is
     * also proof the request was never EXECUTED, so the re-send is the
     * first execution -- safe even for non-idempotent opcodes.
     * Without the negotiated feature the loop body runs exactly once. */
	for (unsigned send_attempt = 0u;; ++send_attempt) {
		alp_status_t s = alp_spi_write(ctx->spi, req, crc_covered + 2u);
		if (s != ALP_OK) return s;

		/* Let the slave's CS-rising handler stage the reply before the first
         * read (see the schedule comment above) -- cheaper than eating a
         * wasted drain transaction + a ladder wait on every command. */
		alp_delay_us(reply_staging_gap_us(cmd, req_payload, req_payload_len));

		/* Reply envelope: SOF | STATUS | PAYLOAD | CRC(SOF..PAYLOAD).
         * Total bytes the host must clock = 1 + 1 + reply_payload_len + 2.
         * Read with the re-read schedule above: a too-early read is a
         * harmless miss, not a failure.
         *
         * STATUS byte on SPI = [7:4] sequence stamp (zero until the
         * v0.7 STATUS_SEQ feature is negotiated; old firmware never
         * sets these bits) | [3:0] status code -- masking the code is
         * unconditionally safe on this transport. */
		uint8_t      reply[GD32G553_MAX_SPI_FRAME_BYTES];
		const size_t reply_len = 2u + reply_payload_len + 2u;
		if (reply_len > sizeof(reply)) return ALP_ERR_INVAL;

		bool reply_ok = false;
		bool stale    = false;
		for (unsigned attempt = 0u; attempt < GD32G553_REPLY_READ_TRIES; ++attempt) {
			s = alp_spi_read(ctx->spi, reply, reply_len);
			if (s != ALP_OK) return s; /* transport-level error: fail loud */

			if (reply[0] == GD32G553_BRIDGE_SOF) {
				const uint16_t expect_crc = alp_crc16_ccitt_false(reply, 2u + reply_payload_len);
				const uint16_t got_crc    = (uint16_t)reply[2u + reply_payload_len] |
				                            (uint16_t)reply[2u + reply_payload_len + 1u] << 8;
				if (got_crc == expect_crc) {
					reply_ok = true;
					break;
				}

				/* ERROR-ENVELOPE FALLBACK.  Firmware error replies carry NO
                 * payload (stage_error_reply: SOF | STATUS | CRC = 4 bytes)
                 * regardless of the opcode's success-reply width, so for any
                 * payload-bearing opcode the full-width CRC check above
                 * fails on a legitimate error reply -- the bytes past the
                 * 4-byte envelope are TX-FIFO idle filler.  Without this
                 * fallback every firmware error surfaced as ALP_ERR_IO,
                 * masking the real status (silicon 2026-06-04: an entire
                 * class of "-5 from cycle 1" HiL rows -- pwm_capture's
                 * documented NOSUPPORT among them -- were short error
                 * replies the host could not decode). */
				if (reply_payload_len > 0u &&
				    (reply[1] & GD32G553_STATUS_CODE_MASK) != 0x00u /* STATUS_OK */) {
					const uint16_t err_crc = alp_crc16_ccitt_false(reply, 2u);
					const uint16_t err_got = (uint16_t)reply[2] | ((uint16_t)reply[3] << 8);
					if (err_got == err_crc) {
						if (ctx->seq_enabled) {
							const uint8_t stamp = (uint8_t)(reply[1] >> 4);
							if (stamp == ctx->seq_last) {
								stale = true; /* stale ERROR reply: re-send */
								break;
							}
							ctx->seq_last = stamp;
						}
						if (cmd != 0x00u /* PING */) spi_resync_after_failure(ctx);
						return status_from_wire(reply[1] & GD32G553_STATUS_CODE_MASK);
					}
				}
			}
			if (attempt + 1u < GD32G553_REPLY_READ_TRIES) {
				alp_delay_us(gd32g553_reply_retry_us[attempt]);
			}
		}
		if (!reply_ok && !stale) {
			if (cmd != 0x00u /* PING */) spi_resync_after_failure(ctx);
			return ALP_ERR_IO;
		}

		if (reply_ok) {
			const uint8_t code  = (uint8_t)(reply[1] & GD32G553_STATUS_CODE_MASK);
			const uint8_t stamp = (uint8_t)(reply[1] >> 4);

			if (cmd == GD32G553_CMD_LINK_FEATURES && code == 0x00u && reply_payload_len >= 1u) {
				/* Negotiation reply: arm/disarm host-side sequencing and
                 * take THIS reply's stamp as the baseline (the firmware
                 * stamps the negotiation reply itself once it grants). */
				ctx->seq_enabled = (reply[2] & GD32G553_LINK_FEAT_STATUS_SEQ) != 0u;
				ctx->seq_last    = stamp;
			} else if (ctx->seq_enabled) {
				if (stamp == ctx->seq_last) {
					stale = true; /* slave never decoded the request */
				} else {
					ctx->seq_last = stamp;
				}
			}

			if (!stale) {
				const alp_status_t firmware_status = status_from_wire(code);
				if (firmware_status != ALP_OK) return firmware_status;

				if (reply_payload_len > 0u && reply_payload != NULL) {
					memcpy(reply_payload, &reply[2], reply_payload_len);
				}
				return ALP_OK;
			}
		}

		/* Stale reply detected.  One re-send: the hazard is a
         * single-transaction race, so the second attempt is expected
         * to land; a SECOND stale in a row means the link is wedged
         * beyond this mechanism -- resync + fail loud. */
		ctx->seq_stale_count++;
		if (send_attempt >= 1u) {
			if (cmd != 0x00u /* PING */) spi_resync_after_failure(ctx);
			return ALP_ERR_IO;
		}
	}
}

/* ----------------------------------------------------------------- */
/* Transport: I2C                                                     */
/* ----------------------------------------------------------------- */

static alp_status_t i2c_xfer(gd32g553_t    *ctx,
                             uint8_t        cmd,
                             const uint8_t *req_payload,
                             size_t         req_payload_len,
                             uint8_t       *reply_payload,
                             size_t         reply_payload_len)
{
	if (ctx->i2c == NULL) return ALP_ERR_NOSUPPORT;

