alplabai/alp-sdk/chips/gd32g553/gd32g553.c
	/* Write side: [reg=0x00][CMD][PAYLOAD][CRC(CMD..PAYLOAD) lo, hi] */
	uint8_t wbuf[GD32G553_MAX_I2C_WRITE_BYTES];
	if (1u + 1u + req_payload_len + 2u > sizeof(wbuf)) return ALP_ERR_INVAL;

	wbuf[0] = GD32G553_BRIDGE_I2C_REG_CMD; /* virtual command register */
	wbuf[1] = cmd;
	if (req_payload_len > 0u && req_payload != NULL) {
		memcpy(&wbuf[2], req_payload, req_payload_len);
	}
	/* CRC covers CMD | PAYLOAD (NOT the reg byte, NOT the I2C address). */
	const size_t   crc_covered      = 1u + req_payload_len;
	const uint16_t crc              = alp_crc16_ccitt_false(&wbuf[1], crc_covered);
	wbuf[2u + req_payload_len]      = (uint8_t)(crc & 0xFFu);
	wbuf[2u + req_payload_len + 1u] = (uint8_t)((crc >> 8) & 0xFFu);

	const size_t wlen = 2u + req_payload_len + 2u;

	/* Read side: [STATUS][PAYLOAD][CRC(STATUS..PAYLOAD) lo, hi] */
	uint8_t      rbuf[GD32G553_MAX_I2C_READ_BYTES];
	const size_t rlen = 1u + reply_payload_len + 2u;
	if (rlen > sizeof(rbuf)) return ALP_ERR_INVAL;

	/* Combined write-then-(repeated-start)-read.  The firmware can
     * clock-stretch between phases to give itself time to process
     * the request; the bridge doc §5 documents this behaviour. */
	alp_status_t s = alp_i2c_write_read(ctx->i2c, ctx->i2c_addr, wbuf, wlen, rbuf, rlen);
	if (s != ALP_OK) return s;

	const uint16_t expect_crc = alp_crc16_ccitt_false(rbuf, 1u + reply_payload_len);
	const uint16_t got_crc =
	    (uint16_t)rbuf[1u + reply_payload_len] | (uint16_t)rbuf[1u + reply_payload_len + 1u] << 8;
	if (got_crc != expect_crc) {
		/* Error-envelope fallback -- same trap as the SPI side: firmware
         * error replies carry no payload ([STATUS][CRC] = 3 bytes on
         * I2C), so the full-width CRC fails on a legitimate error.
         * Decode the short shape before declaring transport failure. */
		if (reply_payload_len > 0u && rbuf[0] != 0x00u /* STATUS_OK */) {
			const uint16_t err_crc = alp_crc16_ccitt_false(rbuf, 1u);
			const uint16_t err_got = (uint16_t)rbuf[1] | ((uint16_t)rbuf[2] << 8);
			if (err_got == err_crc) {
				return status_from_wire(rbuf[0]);
			}
		}
		return ALP_ERR_IO;
	}

	const alp_status_t firmware_status = status_from_wire(rbuf[0]);
	if (firmware_status != ALP_OK) return firmware_status;

	if (reply_payload_len > 0u && reply_payload != NULL) {
		memcpy(reply_payload, &rbuf[1], reply_payload_len);
	}
	return ALP_OK;
}

/* ----------------------------------------------------------------- */
/* Transport router                                                   */
/* ----------------------------------------------------------------- */

static alp_status_t cmd_send(gd32g553_t          *ctx,
                             gd32g553_transport_t t,
                             uint8_t              cmd,
                             const uint8_t       *req_payload,
                             size_t               req_payload_len,
                             uint8_t             *reply_payload,
                             size_t               reply_payload_len)
{
	if (t == GD32G553_TRANSPORT_DEFAULT) t = ctx->default_transport;
	switch (t) {
	case GD32G553_TRANSPORT_SPI:
		return spi_xfer(ctx, cmd, req_payload, req_payload_len, reply_payload, reply_payload_len);
	case GD32G553_TRANSPORT_I2C:
		return i2c_xfer(ctx, cmd, req_payload, req_payload_len, reply_payload, reply_payload_len);
	default:
		return ALP_ERR_INVAL;
	}
}

/* ----------------------------------------------------------------- */
/* Public API                                                          */
/* ----------------------------------------------------------------- */

/* OTA trial-boot window: after OTA_COMMIT/OTA_ROLLBACK the bridge
 * reboots into an unconfirmed TRIAL image and answers STATUS_BUSY to
 * EVERY opcode -- including PING/GET_VERSION -- until it decodes its
 * first CRC-valid frame, which itself confirms the trial; the bridge
 * then resets a SECOND time to boot the now-confirmed image, so the
 * link also drops for a few ms right after that first BUSY reply
 * lands.  That second drop surfaces to the host as a transient
 * transport error (STATUS_IO, or a CRC miss the driver already maps
 * to ALP_ERR_IO), not BUSY.  Ride out both here so a caller that
 * re-inits right after COMMIT/ROLLBACK (docs/gd32-bridge-protocol.md
 * §10) doesn't have to hand-roll its own retry loop.  Non-transient
 * failures (NOSUPPORT, INVAL, a genuine version mismatch) return
 * immediately -- retrying those only delays a real failure.
 *
 * Budget: 2 s total, geometric-then-flat backoff.  The bootloader's
 * FWDGT window is ~32.8 s nominal (far longer than this budget), so
 * 2 s is sized to the confirm+reboot path, not the watchdog-revert
 * path -- a caller riding out an actual revert will simply see this
 * budget expire and get back the transient status, same as any other
 * failed init. */
#define GD32G553_INIT_RETRY_BUDGET_MS 2000u
static const uint16_t gd32g553_init_retry_ms[] = { 10u, 20u, 40u, 80u, 160u, 160u, 160u, 160u };

static bool gd32g553_init_status_is_transient(alp_status_t s)
{
	return s == ALP_ERR_BUSY || s == ALP_ERR_IO;
}

/* Sleep the next rung of the ladder and account it against the budget.
 * Returns false once the budget is spent (caller gives up with the
 * last status it saw). */
static bool gd32g553_init_retry_wait(unsigned *attempt, uint32_t *elapsed_ms)
{
	if (*elapsed_ms >= GD32G553_INIT_RETRY_BUDGET_MS) return false;
	const unsigned rung =
	    (*attempt < (sizeof(gd32g553_init_retry_ms) / sizeof(gd32g553_init_retry_ms[0])))
	        ? *attempt
	        : (unsigned)(sizeof(gd32g553_init_retry_ms) / sizeof(gd32g553_init_retry_ms[0])) - 1u;
	const uint16_t wait_ms = gd32g553_init_retry_ms[rung];
	alp_delay_ms(wait_ms);
	*elapsed_ms += wait_ms;
	(*attempt)++;
	return true;
}

alp_status_t gd32g553_init(gd32g553_t *ctx, alp_spi_t *spi, alp_i2c_t *i2c, uint8_t i2c_addr_7bit)
{
	if (ctx == NULL) return ALP_ERR_INVAL;
	if (spi == NULL && i2c == NULL) return ALP_ERR_INVAL;
	if (i2c != NULL && i2c_addr_7bit > 0x7Fu) return ALP_ERR_INVAL;

	memset(ctx, 0, sizeof(*ctx));
	ctx->spi               = spi;
	ctx->i2c               = i2c;
	ctx->i2c_addr          = i2c_addr_7bit;
	ctx->default_transport = (spi != NULL) ? GD32G553_TRANSPORT_SPI : GD32G553_TRANSPORT_I2C;
	ctx->initialised       = true;

	alp_status_t s;
	unsigned     attempt    = 0u;
	uint32_t     elapsed_ms = 0u;
	for (;;) {
		s = gd32g553_ping(ctx);
		if (!gd32g553_init_status_is_transient(s)) break;
		if (!gd32g553_init_retry_wait(&attempt, &elapsed_ms)) break;
	}
	if (s != ALP_OK) {
		ctx->initialised = false;
		return s;
	}

	gd32g553_version_t v;
	attempt    = 0u;
	elapsed_ms = 0u;
	for (;;) {
		s = gd32g553_get_version(ctx, &v);
		if (!gd32g553_init_status_is_transient(s)) break;
		if (!gd32g553_init_retry_wait(&attempt, &elapsed_ms)) break;
	}
	if (s != ALP_OK) {
		ctx->initialised = false;
		return s;
	}
	if (v.major != GD32G553_HOST_PROTOCOL_MAJOR) {
		ctx->initialised = false;
		return ALP_ERR_NOSUPPORT;
	}
	ctx->version = v;

	/* v0.7 link-feature negotiation (best-effort, SPI only -- the
     * STATUS_SEQ stamp is an SPI-framing feature).  Old firmware
     * answers STATUS_NOSUPPORT and the link stays on the legacy
     * framing; ctx->seq_enabled records the outcome (spi_xfer arms it
     * from the negotiation reply itself, which carries the stamp
     * baseline).  Any error here is deliberately non-fatal: the
     * feature is an integrity upgrade, not a liveness requirement. */
	if (ctx->spi != NULL) {
		uint8_t want    = GD32G553_LINK_FEAT_STATUS_SEQ;
		uint8_t granted = 0u;
		(void)cmd_send(
		    ctx, GD32G553_TRANSPORT_SPI, GD32G553_CMD_LINK_FEATURES, &want, 1u, &granted, 1u);
	}
	return ALP_OK;
}

alp_status_t gd32g553_set_default_transport(gd32g553_t *ctx, gd32g553_transport_t t)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (t == GD32G553_TRANSPORT_SPI && ctx->spi == NULL) return ALP_ERR_NOSUPPORT;
	if (t == GD32G553_TRANSPORT_I2C && ctx->i2c == NULL) return ALP_ERR_NOSUPPORT;
	if (t != GD32G553_TRANSPORT_SPI && t != GD32G553_TRANSPORT_I2C) return ALP_ERR_INVAL;
	ctx->default_transport = t;
	return ALP_OK;
}

alp_status_t gd32g553_ping(gd32g553_t *ctx)
{
	if (ctx == NULL) return ALP_ERR_INVAL;
	/* Allow ping during init even before initialised==true: this is the
     * link-liveness probe gd32g553_init() runs.  The transport pointers
     * have already been set at that point. */
	return cmd_send(ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_PING, NULL, 0u, NULL, 0u);
}

alp_status_t gd32g553_ping_via(gd32g553_t *ctx, gd32g553_transport_t t)
{
	if (ctx == NULL) return ALP_ERR_INVAL;
	return cmd_send(ctx, t, GD32G553_CMD_PING, NULL, 0u, NULL, 0u);
}

alp_status_t gd32g553_get_version(gd32g553_t *ctx, gd32g553_version_t *out)
{
	if (ctx == NULL || out == NULL) return ALP_ERR_INVAL;
	uint8_t      reply[3];
	alp_status_t s = cmd_send(
	    ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_GET_VERSION, NULL, 0u, reply, sizeof(reply));
	if (s != ALP_OK) return s;
	out->major = reply[0];
	out->minor = reply[1];
	out->patch = reply[2];
	return ALP_OK;
}

alp_status_t gd32g553_get_build_id(gd32g553_t *ctx, char build_id[GD32G553_BUILD_ID_LEN + 1])
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (build_id == NULL) return ALP_ERR_INVAL;
	uint8_t      reply[GD32G553_BUILD_ID_LEN];
	alp_status_t s = cmd_send(
	    ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_GET_BUILD_ID, NULL, 0u, reply, sizeof(reply));
	if (s != ALP_OK) return s;
	memcpy(build_id, reply, GD32G553_BUILD_ID_LEN);
	build_id[GD32G553_BUILD_ID_LEN] = '\0';
	return ALP_OK;
}

