alplabai/alp-sdk/chips/gd32g553/gd32g553.c
alp_status_t gd32g553_get_reset_reason(gd32g553_t *ctx, gd32g553_reset_cause_t *out)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (out == NULL) return ALP_ERR_INVAL;
	uint8_t      reply;
	alp_status_t s =
	    cmd_send(ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_RESET_REASON, NULL, 0u, &reply, 1u);
	if (s != ALP_OK) return s;
	*out = (gd32g553_reset_cause_t)reply;
	return ALP_OK;
}

/* Little-endian uint32 read / write helpers. */
static void put_le32(uint8_t *p, uint32_t v)
{
	p[0] = (uint8_t)(v & 0xFFu);
	p[1] = (uint8_t)((v >> 8) & 0xFFu);
	p[2] = (uint8_t)((v >> 16) & 0xFFu);
	p[3] = (uint8_t)((v >> 24) & 0xFFu);
}

static uint32_t get_le32(const uint8_t *p)
{
	return (uint32_t)p[0] | ((uint32_t)p[1] << 8) | ((uint32_t)p[2] << 16) | ((uint32_t)p[3] << 24);
}

alp_status_t gd32g553_gpio_read(gd32g553_t *ctx, uint32_t mask, uint32_t *levels)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (levels == NULL) return ALP_ERR_INVAL;
	uint8_t req[4];
	put_le32(req, mask);
	uint8_t      reply[4];
	alp_status_t s = cmd_send(ctx,
	                          GD32G553_TRANSPORT_DEFAULT,
	                          GD32G553_CMD_GPIO_READ,
	                          req,
	                          sizeof(req),
	                          reply,
	                          sizeof(reply));
	if (s != ALP_OK) return s;
	*levels = get_le32(reply);
	return ALP_OK;
}

alp_status_t gd32g553_gpio_write(gd32g553_t *ctx, uint32_t mask, uint32_t levels)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	uint8_t req[8];
	put_le32(&req[0], mask);
	put_le32(&req[4], levels);
	return cmd_send(
	    ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_GPIO_WRITE, req, sizeof(req), NULL, 0u);
}

alp_status_t
gd32g553_pwm_set(gd32g553_t *ctx, uint8_t channel, uint32_t period_ns, uint32_t duty_ns)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (duty_ns > period_ns) return ALP_ERR_INVAL;
	uint8_t req[10];
	req[0] = channel;
	req[1] = 0u; /* reserved */
	put_le32(&req[2], period_ns);
	put_le32(&req[6], duty_ns);
	return cmd_send(
	    ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_PWM_SET, req, sizeof(req), NULL, 0u);
}

alp_status_t
gd32g553_pwm_get(gd32g553_t *ctx, uint8_t channel, uint32_t *period_ns, uint32_t *duty_ns)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (period_ns == NULL || duty_ns == NULL) return ALP_ERR_INVAL;
	uint8_t      req = channel;
	uint8_t      reply[8];
	alp_status_t s = cmd_send(
	    ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_PWM_GET, &req, 1u, reply, sizeof(reply));
	if (s != ALP_OK) return s;
	*period_ns = get_le32(&reply[0]);
	*duty_ns   = get_le32(&reply[4]);
	return ALP_OK;
}

alp_status_t gd32g553_adc_read(gd32g553_t *ctx, uint8_t channel, uint8_t samples, uint16_t *mv)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (mv == NULL) return ALP_ERR_INVAL;
	if (samples == 0u || samples > GD32G553_BRIDGE_ADC_MAX_SAMPLES) {
		return ALP_ERR_INVAL;
	}

	uint8_t req[2] = { channel, samples };
	/* Reply payload echoes `samples` then carries 2 bytes per reading.
     * cmd_send needs the reply length known up-front; the host passes
     * the same `samples` it requested. */
	const size_t reply_payload_len = 1u + (size_t)samples * 2u;
	uint8_t      reply[1u + (GD32G553_BRIDGE_ADC_MAX_SAMPLES * 2u)];

	alp_status_t s = cmd_send(ctx,
	                          GD32G553_TRANSPORT_DEFAULT,
	                          GD32G553_CMD_ADC_READ,
	                          req,
	                          sizeof(req),
	                          reply,
	                          reply_payload_len);
	if (s != ALP_OK) return s;

	/* The firmware MUST echo the same samples value back at byte 0.
     * If it doesn't, the host treats the frame as corrupt -- the
     * CRC has already passed so this guards against a firmware bug,
     * not a wire glitch. */
	if (reply[0] != samples) return ALP_ERR_IO;

	for (uint8_t i = 0u; i < samples; ++i) {
		mv[i] = (uint16_t)reply[1u + i * 2u] | (uint16_t)reply[1u + i * 2u + 1u] << 8;
	}
	return ALP_OK;
}

alp_status_t gd32g553_da9292_status_forward(gd32g553_t *ctx, uint8_t *status)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (status == NULL) return ALP_ERR_INVAL;
	return cmd_send(
	    ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_DA9292_STATUS_FORWARD, NULL, 0u, status, 1u);
}

alp_status_t gd32g553_se_reset(gd32g553_t *ctx, bool assert)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	const uint8_t req = assert ? 1u : 0u;
	return cmd_send(ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_SE_RESET, &req, 1u, NULL, 0u);
}

alp_status_t gd32g553_dac_set(gd32g553_t *ctx, uint8_t channel, uint16_t value_mv)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (channel >= GD32G553_BRIDGE_DAC_CHANNELS) return ALP_ERR_INVAL;
	uint8_t req[4];
	req[0] = channel;
	req[1] = 0u; /* reserved */
	req[2] = (uint8_t)(value_mv & 0xFFu);
	req[3] = (uint8_t)((value_mv >> 8) & 0xFFu);
	return cmd_send(
	    ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_DAC_SET, req, sizeof(req), NULL, 0u);
}

alp_status_t gd32g553_dac_get(gd32g553_t *ctx, uint8_t channel, uint16_t *value_mv)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (value_mv == NULL) return ALP_ERR_INVAL;
	if (channel >= GD32G553_BRIDGE_DAC_CHANNELS) return ALP_ERR_INVAL;
	uint8_t      reply[2];
	alp_status_t s = cmd_send(
	    ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_DAC_GET, &channel, 1u, reply, sizeof(reply));
	if (s != ALP_OK) return s;
	*value_mv = (uint16_t)reply[0] | ((uint16_t)reply[1] << 8);
	return ALP_OK;
}

alp_status_t gd32g553_qenc_read(gd32g553_t *ctx, uint8_t encoder, int32_t *position_out)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (position_out == NULL) return ALP_ERR_INVAL;
	if (encoder >= GD32G553_BRIDGE_QENC_CHANNELS) return ALP_ERR_INVAL;
	uint8_t      reply[4];
	alp_status_t s = cmd_send(ctx,
	                          GD32G553_TRANSPORT_DEFAULT,
	                          GD32G553_CMD_QENC_READ,
	                          &encoder,
	                          1u,
	                          reply,
	                          sizeof(reply));
	if (s != ALP_OK) return s;
	*position_out = (int32_t)get_le32(reply);
	return ALP_OK;
}

alp_status_t gd32g553_qenc_reset(gd32g553_t *ctx, uint8_t encoder)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (encoder >= GD32G553_BRIDGE_QENC_CHANNELS) return ALP_ERR_INVAL;
	return cmd_send(
	    ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_QENC_RESET, &encoder, 1u, NULL, 0u);
}

alp_status_t gd32g553_counter_read(gd32g553_t *ctx, uint8_t counter, uint32_t *ticks_out)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (ticks_out == NULL) return ALP_ERR_INVAL;
	if (counter >= GD32G553_BRIDGE_COUNTER_CHANNELS) return ALP_ERR_INVAL;
	uint8_t      reply[4];
	alp_status_t s = cmd_send(ctx,
	                          GD32G553_TRANSPORT_DEFAULT,
	                          GD32G553_CMD_COUNTER_READ,
	                          &counter,
	                          1u,
	                          reply,
	                          sizeof(reply));
	if (s != ALP_OK) return s;
	*ticks_out = get_le32(reply);
	return ALP_OK;
}

