alplabai/alp-sdk/chips/gd32g553/gd32g553.c
/* ------------------------------------------------------------------ */
/* v0.4 -- GD32G5 TMU (CORDIC) math accelerator                        */
/* ------------------------------------------------------------------ */

alp_status_t gd32g553_tmu_compute(gd32g553_t             *ctx,
                                  gd32g553_tmu_function_t function,
                                  gd32g553_tmu_format_t   format,
                                  uint32_t                in_a,
                                  uint32_t                in_b,
                                  uint32_t               *result_out)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (result_out == NULL) return ALP_ERR_INVAL;
	/* Range-check the function + format enums host-side so callers
     * find typos at the API boundary rather than after a wire trip. */
	if ((unsigned)function > (unsigned)GD32G553_TMU_FN_HYPOT) return ALP_ERR_INVAL;
	if ((unsigned)format > (unsigned)GD32G553_TMU_FMT_F32) return ALP_ERR_INVAL;

	uint8_t req[12];
	req[0] = (uint8_t)function;
	req[1] = (uint8_t)format;
	req[2] = 0u; /* reserved */
	req[3] = 0u; /* reserved */
	put_le32(&req[4], in_a);
	put_le32(&req[8], in_b);

	uint8_t      reply[4] = { 0 };
	alp_status_t s        = cmd_send(ctx,
	                                 GD32G553_TRANSPORT_DEFAULT,
	                                 GD32G553_CMD_TMU_COMPUTE,
	                                 req,
	                                 sizeof(req),
	                                 reply,
	                                 sizeof(reply));
	if (s != ALP_OK) return s;
	*result_out = get_le32(reply);
	return ALP_OK;
}

/* ----------------------------------------------------------------- */
/* v0.5 (§2B.2 + §2B.3) -- advanced timer extras + power-mode set    */
/*                                                                    */
/* Wire frames per docs/gd32-bridge-protocol.md.  Firmware returns   */
/* STATUS_NOSUPPORT today via the default-case dispatch until the    */
/* corresponding bridge_hw_* HAL bodies land; the host helpers below */
/* return ALP_ERR_NOSUPPORT in lockstep.                              */
/* ----------------------------------------------------------------- */

alp_status_t gd32g553_pwm_capture_begin(gd32g553_t *ctx, uint8_t channel, uint8_t edge)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (edge > 2u) return ALP_ERR_INVAL;
	uint8_t req[2] = { channel, edge };
	return cmd_send(ctx,
	                GD32G553_TRANSPORT_DEFAULT,
	                GD32G553_CMD_PWM_CAPTURE_BEGIN,
	                req,
	                sizeof(req),
	                NULL,
	                0u);
}

alp_status_t
gd32g553_pwm_capture_read(gd32g553_t *ctx, uint8_t channel, uint32_t *period_ns, uint32_t *pulse_ns)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (period_ns == NULL && pulse_ns == NULL) return ALP_ERR_INVAL;
	uint8_t      req[1]   = { channel };
	uint8_t      reply[8] = { 0 };
	alp_status_t s        = cmd_send(ctx,
	                                 GD32G553_TRANSPORT_DEFAULT,
	                                 GD32G553_CMD_PWM_CAPTURE_READ,
	                                 req,
	                                 sizeof(req),
	                                 reply,
	                                 sizeof(reply));
	if (s != ALP_OK) return s;
	if (period_ns != NULL) *period_ns = get_le32(&reply[0]);
	if (pulse_ns != NULL) *pulse_ns = get_le32(&reply[4]);
	return ALP_OK;
}

alp_status_t gd32g553_pwm_capture_end(gd32g553_t *ctx, uint8_t channel)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	uint8_t req[1] = { channel };
	return cmd_send(
	    ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_PWM_CAPTURE_END, req, sizeof(req), NULL, 0u);
}

alp_status_t gd32g553_pwm_single_pulse(gd32g553_t *ctx, uint8_t channel, uint32_t pulse_ns)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (pulse_ns == 0u) return ALP_ERR_INVAL;
	uint8_t req[8];
	req[0] = channel;
	req[1] = 0u; /* reserved */
	req[2] = 0u;
	req[3] = 0u;
	put_le32(&req[4], pulse_ns);
	return cmd_send(
	    ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_PWM_SINGLE_PULSE, req, sizeof(req), NULL, 0u);
}

alp_status_t gd32g553_timer_sync(gd32g553_t *ctx, uint8_t master, uint8_t slave, uint8_t mode)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	uint8_t req[3] = { master, slave, mode };
	return cmd_send(
	    ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_TIMER_SYNC, req, sizeof(req), NULL, 0u);
}

alp_status_t
gd32g553_power_mode_set(gd32g553_t *ctx, uint8_t mode, uint32_t wake_bitmap, uint32_t wake_after_ms)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (mode > 3u) return ALP_ERR_INVAL;
	uint8_t req[10];
	req[0] = mode;
	req[1] = 0u; /* reserved */
	put_le32(&req[2], wake_bitmap);
	put_le32(&req[6], wake_after_ms);
	return cmd_send(
	    ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_POWER_MODE_SET, req, sizeof(req), NULL, 0u);
}

/* ----------------------------------------------------------------- */
/* v0.5 (§2B wave-2) -- chunked DSP-chain upload                     */
/*                                                                    */
/* Wire frames per docs/gd32-bridge-protocol.md §3.x.  Firmware       */
/* returns STATUS_NOSUPPORT today via the default-case dispatch       */
/* until the bridge_hw_adc_dsp_* HAL bodies land; the host helpers    */
/* below short-circuit to ALP_ERR_NOSUPPORT in lockstep with that     */
/* contract -- the wire request still serialises correctly so the    */
/* firmware-side handler tree sees real envelopes when it ships.     */
/* ----------------------------------------------------------------- */

alp_status_t gd32g553_adc_dsp_chain_open(gd32g553_t *ctx, uint8_t *chain_id_out)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (chain_id_out == NULL) return ALP_ERR_INVAL;

	uint8_t      reply[1] = { 0 };
	alp_status_t s        = cmd_send(ctx,
	                                 GD32G553_TRANSPORT_DEFAULT,
	                                 GD32G553_CMD_ADC_DSP_CHAIN_OPEN,
	                                 NULL,
	                                 0u,
	                                 reply,
	                                 sizeof(reply));
	if (s != ALP_OK) return s;
	*chain_id_out = reply[0];
	return ALP_OK;
}

alp_status_t gd32g553_adc_dsp_stage_push(gd32g553_t    *ctx,
                                         uint8_t        chain_id,
                                         uint8_t        stage_index,
                                         uint8_t        kind,
                                         const uint8_t *stage_params,
                                         uint16_t       stage_params_len)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (stage_index >= GD32G553_BRIDGE_ADC_DSP_MAX_STAGES) return ALP_ERR_INVAL;
	if (kind > 3u) return ALP_ERR_INVAL;
	if (stage_params == NULL && stage_params_len != 0u) return ALP_ERR_INVAL;
	if (stage_params_len > GD32G553_BRIDGE_ADC_DSP_MAX_STAGE_BYTES) return ALP_ERR_OUT_OF_RANGE;

	/* Chunk the per-kind blob into wire envelopes no larger than
     * MAX_CHUNK_BYTES.  Empty blobs (stage_params_len == 0) still
     * send a single zero-length STAGE_PUSH so the firmware sees the
     * kind declaration arrive at the requested stage_index.  The
     * 7-byte header is chain_id + stage_index + kind + chunk_offset:u16
     * + chunk_total_size:u16; chunk_total_size carries the FULL
     * per-kind blob length (not this chunk's length) so the firmware
     * knows when assembly is complete. */
	uint16_t offset = 0u;
	do {
		uint16_t this_chunk = (uint16_t)(stage_params_len - offset);
		if (this_chunk > GD32G553_BRIDGE_ADC_DSP_MAX_CHUNK_BYTES) {
			this_chunk = GD32G553_BRIDGE_ADC_DSP_MAX_CHUNK_BYTES;
		}
		uint8_t req[7u + GD32G553_BRIDGE_ADC_DSP_MAX_CHUNK_BYTES];
		req[0] = chain_id;
		req[1] = stage_index;
		req[2] = kind;
		req[3] = (uint8_t)(offset & 0xFFu);
		req[4] = (uint8_t)((offset >> 8) & 0xFFu);
		req[5] = (uint8_t)(stage_params_len & 0xFFu);
		req[6] = (uint8_t)((stage_params_len >> 8) & 0xFFu);
		if (this_chunk > 0u) {
			memcpy(&req[7], stage_params + offset, this_chunk);
		}
		alp_status_t s = cmd_send(ctx,
		                          GD32G553_TRANSPORT_DEFAULT,
		                          GD32G553_CMD_ADC_DSP_STAGE_PUSH,
		                          req,
		                          (size_t)(7u + this_chunk),
		                          NULL,
		                          0u);
		if (s != ALP_OK) return s;
		offset = (uint16_t)(offset + this_chunk);
	} while (offset < stage_params_len);

	return ALP_OK;
}

alp_status_t gd32g553_adc_dsp_chain_bind(gd32g553_t *ctx, uint8_t chain_id, uint8_t stream_id)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (stream_id >= GD32G553_BRIDGE_ADC_STREAM_COUNT) return ALP_ERR_INVAL;
	uint8_t req[2] = { chain_id, stream_id };
	return cmd_send(ctx,
	                GD32G553_TRANSPORT_DEFAULT,
	                GD32G553_CMD_ADC_DSP_CHAIN_BIND,
	                req,
	                sizeof(req),
	                NULL,
	                0u);
}

/* ----------------------------------------------------------------- */
/* OTA helpers -- the firmware-side opcodes return STATUS_NOSUPPORT  */
/* against the scaffold today, which maps to ALP_ERR_NOSUPPORT here. */
/* When the bridge ships real bodies the same call paths return the  */
/* documented payloads.  GET_STATE answers concretely against the    */
/* scaffold so customer telemetry already works.                      */
/* ----------------------------------------------------------------- */

