alplabai/alp-sdk/chips/gd32g553/gd32g553.c
bool gd32g553_ota_supported(const gd32g553_t *ctx)
{
	return ctx != NULL && ctx->initialised && ctx->version.minor >= GD32G553_OTA_MIN_PROTOCOL_MINOR;
}

alp_status_t gd32g553_ota_begin(gd32g553_t               *ctx,
                                uint32_t                  size_bytes,
                                uint32_t                  expected_crc32,
                                const gd32g553_version_t *fw_version,
                                uint16_t                 *chunk_max_bytes,
                                gd32g553_ota_slot_t      *target_slot)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (chunk_max_bytes == NULL || target_slot == NULL) return ALP_ERR_INVAL;
	if (size_bytes == 0u) return ALP_ERR_INVAL;
	/* Refuse a pre-v0.6 peer BEFORE the bridge erases the target slot: the
	 * v0.6 chunk framing it would receive corrupts the image (#751). */
	if (!gd32g553_ota_supported(ctx)) return ALP_ERR_NOSUPPORT;

	/* v0.7 additive form: size:u32, crc:u32 [, maj:u8, min:u8, pat:u8].
     * The version triple lands in the bridge's A/B metadata record at
     * COMMIT (fw_version[slot], "0 = unknown").  NULL = send the legacy
     * 8-byte form; older firmware ignores the 3 trailing bytes of the
     * long form, so either pairing degrades gracefully. */
	uint8_t      req[11];
	const size_t req_len = (fw_version != NULL) ? 11u : 8u;
	put_le32(&req[0], size_bytes);
	put_le32(&req[4], expected_crc32);
	if (fw_version != NULL) {
		req[8]  = fw_version->major;
		req[9]  = fw_version->minor;
		req[10] = fw_version->patch;
	}

	/* Reply: chunk_max_bytes:u16 + target_slot:u8. */
	uint8_t      reply[3] = { 0 };
	alp_status_t s        = cmd_send(ctx,
	                                 GD32G553_TRANSPORT_DEFAULT,
	                                 GD32G553_CMD_OTA_BEGIN,
	                                 req,
	                                 req_len,
	                                 reply,
	                                 sizeof(reply));
	if (s != ALP_OK) return s;
	*chunk_max_bytes = (uint16_t)reply[0] | ((uint16_t)reply[1] << 8);
	*target_slot     = (gd32g553_ota_slot_t)reply[2];
	return ALP_OK;
}

alp_status_t gd32g553_ota_write_chunk(gd32g553_t    *ctx,
                                      uint32_t       offset,
                                      const uint8_t *data,
                                      size_t         data_len,
                                      uint32_t      *received_bytes)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (data == NULL || data_len == 0u) return ALP_ERR_INVAL;
	if (received_bytes == NULL) return ALP_ERR_INVAL;
	/* Belt-and-suspenders: even if a caller skips BEGIN's gate, never
	 * program the v0.6 chunk layout into a pre-v0.6 peer (#751). */
	if (!gd32g553_ota_supported(ctx)) return ALP_ERR_NOSUPPORT;

	/* Chunk size is bounded by the wire payload ceiling.  Bridges
     * that advertise a smaller chunk_max_bytes in BEGIN are honoured
     * by the caller -- this helper only enforces the absolute limit.
     * (v0.6: the payload carries an explicit len byte after the
     * offset, so the data ceiling is MAX_PAYLOAD - 5.) */
	if (data_len > GD32G553_MAX_PAYLOAD_BYTES - 5u) return ALP_ERR_INVAL;

	uint8_t req[GD32G553_MAX_PAYLOAD_BYTES] = { 0 };
	put_le32(&req[0], offset);
	req[4] = (uint8_t)data_len; /* v0.6 anti-extension cross-check */
	memcpy(&req[5], data, data_len);

	uint8_t      reply[4] = { 0 };
	alp_status_t s        = cmd_send(ctx,
	                                 GD32G553_TRANSPORT_DEFAULT,
	                                 GD32G553_CMD_OTA_WRITE_CHUNK,
	                                 req,
	                                 5u + data_len,
	                                 reply,
	                                 sizeof(reply));
	if (s != ALP_OK) return s;
	*received_bytes = get_le32(reply);
	return ALP_OK;
}

alp_status_t gd32g553_ota_verify(gd32g553_t *ctx, bool *verified, uint32_t *computed_crc32)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (verified == NULL || computed_crc32 == NULL) return ALP_ERR_INVAL;

	/* Reply: computed_crc32(u32) + verified(u8). */
	uint8_t      reply[5] = { 0 };
	alp_status_t s        = cmd_send(
	    ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_OTA_VERIFY, NULL, 0u, reply, sizeof(reply));
	if (s != ALP_OK) return s;
	*computed_crc32 = get_le32(&reply[0]);
	*verified       = (reply[4] != 0u);
	return ALP_OK;
}

alp_status_t gd32g553_ota_commit(gd32g553_t *ctx)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	return cmd_send(ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_OTA_COMMIT, NULL, 0u, NULL, 0u);
}

alp_status_t gd32g553_ota_rollback(gd32g553_t *ctx)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	return cmd_send(ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_OTA_ROLLBACK, NULL, 0u, NULL, 0u);
}

alp_status_t gd32g553_ota_get_state(gd32g553_t *ctx, gd32g553_ota_state_info_t *out)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	if (out == NULL) return ALP_ERR_INVAL;

	/* Reply: state(u8) + active(u8) + pending(u8) + boot_count(u16 LE). */
	uint8_t      reply[5] = { 0 };
	alp_status_t s        = cmd_send(ctx,
	                                 GD32G553_TRANSPORT_DEFAULT,
	                                 GD32G553_CMD_OTA_GET_STATE,
	                                 NULL,
	                                 0u,
	                                 reply,
	                                 sizeof(reply));
	if (s != ALP_OK) return s;
	out->state        = (gd32g553_ota_state_t)reply[0];
	out->active_slot  = (gd32g553_ota_slot_t)reply[1];
	out->pending_slot = (gd32g553_ota_slot_t)reply[2];
	out->boot_count   = (uint16_t)reply[3] | ((uint16_t)reply[4] << 8);
	return ALP_OK;
}

alp_status_t gd32g553_ota_abort(gd32g553_t *ctx)
{
	if (ctx == NULL || !ctx->initialised) return ALP_ERR_NOT_READY;
	return cmd_send(ctx, GD32G553_TRANSPORT_DEFAULT, GD32G553_CMD_OTA_ABORT, NULL, 0u, NULL, 0u);
}

void gd32g553_deinit(gd32g553_t *ctx)
{
	if (ctx == NULL) return;
	/* Bus handles are owned by the caller -- don't close them. */
	ctx->initialised = false;
	ctx->spi         = NULL;
	ctx->i2c         = NULL;
}
